benchmark_runs/pgbench_results.txt
pgbench (16.13 (Homebrew))
transaction type: benchmarks/sql/pgbench_custom.sql
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 4
maximum number of tries: 1
duration: 5 s
number of transactions actually processed: 19340
number of failed transactions: 0 (0.000%)
latency average = 2.068 ms
initial connection time = 6.342 ms
tps = 3867.890925 (without initial connection time)